IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(5) VALUE 0.
01 NUM2 PIC 9(5) VALUE 0.
01 RESULT PIC 9(7)V99 VALUE 0.

PROCEDURE DIVISION. * This section contains the logic of the program.

    PERFORM DISPLAY_MENU UNTIL CHOICE = '5'. 

    STOP RUN.

DISPLAY_MENU.
    DISPLAY 'CALCULATOR MENU'.
    DISPLAY '1. ADDITION'.
    DISPLAY '2. SUBTRACTION'.
    DISPLAY '3. MULTIPLICATION'.
    DISPLAY '4. DIVISION'.
    DISPLAY '5. EXIT'.
    ACCEPT CHOICE.

    * This section contains the logic for each operation. 
    EVALUATE CHOICE
        WHEN '1' PERFORM ADDITION 
        WHEN '2' PERFORM SUBTRACTION
        WHEN '3' PERFORM MULTIPLICATION
        WHEN '4' PERFORM DIVISION
        WHEN '5' CONTINUE
        WHEN OTHER DISPLAY 'INVALID CHOICE, PLEASE TRY AGAIN.'
    END-EVALUATE.


ADDITION.
    ACCEPT NUM1, NUM2.
    COMPUTE RESULT = NUM1 + NUM2.
    DISPLAY 'Result of addition: ' RESULT.

SUBTRACTION.
    ACCEPT NUM1, NUM2.
    COMPUTE RESULT = NUM1 - NUM2.
    DISPLAY 'Result of subtraction: ' RESULT.

MULTIPLICATION.
    ACCEPT NUM1, NUM2.
    COMPUTE RESULT = NUM1 * NUM2.
    DISPLAY 'Result of multiplication: ' RESULT.

DIVISION.
    ACCEPT NUM1, NUM2.
    IF NUM2 = 0
        DISPLAY 'ERROR: Cannot divide by zero'
    ELSE
        COMPUTE RESULT = NUM1 / NUM2.
        DISPLAY 'Result of division: ' RESULT.
    END-IF.
